# coding=utf-8
# **********************************************************
# lesson_18
# ----------------------------------------------------------
# Master of Code (2021)
# 2021_Разработка GUI приложений на Python 3 и PyQt5
# ----------------------------------------------------------
# Python 3.13.3
# jetBrain PyCharm 2024.2.3
# Designer 5.14 (Qt)
# ----------------------------------------------------------
# pip install pyqt5
# pip install pyqt5-tools
# pyuic5 -x app.ui -o app.py
# ----------------------------------------------------------
# PyQt — это свободное программное обеспечение,
# разработанное британской фирмой Riverbank Computing.
# https://riverbankcomputing.com/
# **********************************************************
# Writing sgiman, 2025

#
# Объект - это структура данных,
# cодержащая: данные-свойства и функции-методы
#
# Класс - это шаблон для создания объектов этого класса
#
# Приватные свойства и методы не доступны за пределами класса.
# Поэтому для приватных методов используются ГЕТТОРЫ и СЕТТОРЫ
#

###############################################
# point_main.py
###############################################
import point as pt  # рекомендуется

#=============================================
# WITH PRIVATE PROPERTIES
#=============================================
p1 = pt.Point(1,33, 'meters')
p2 = pt.Point(4, -9, 'millimeters')
print(p1)

print('-' * 80)

p3D_1 = pt.Point3D(2, 4, 9, 'meters')
p3D_2 = pt.Point3D(5, 14, -29, 'millimeters')

print(p3D_1.distance_to(p3D_2))
print(p3D_1.distance3d_to(p3D_2))
print(p3D_1)
print(p3D_1.hello())

#----------------------------------------
# ГЕТТОРЫ-СЕТТОРЫ
#----------------------------------------
print('-' * 80)

print('2D p1: ', p1.get_units())
print('2D p2: ', p2.get_units())

print('-' * 80)

print('3D p3D_1: ', p3D_1.get_units())
print('3D p3D_2: ', p3D_2.get_units())

p1.set_units('centimeters')
print('UNITS: ', p1.get_units())
